layer {
  type: 'Python'
  name: 'Argumentation'
  top: "template_data"	
  top: "target_data"
  top: "labels"
  python_param {
    module: 'data_argumentation_layer'
    layer: 'DataArgumentationLayer'
    param_str: "{\'batch_size\': 10, \'im_width\': 224, \'im_height\': 224, \'filename\': '/home/krishneel/Documents/datasets/handheld_objects/train.txt', \'directory\': '/home/krishneel/Documents/datasets/handheld_objects/' }"
    }
 }

layer {
 name: "silence"
 type: "Silence"
 bottom: "template_data"	
 bottom: "target_data"
 bottom: "labels"
}
